strCity = "安徽,安徽,安庆,蚌埠,亳州,巢湖,池州,滁州,阜阳,合肥,淮北,淮南,黄山,六安,马鞍山,宿州,铜陵,芜湖,宣城;澳门,澳门;北京,北京;福建,福建,福州,龙岩,南平,宁德,莆田,泉州,三明,厦门,漳州;甘肃,白银,定西地区,甘南藏族自治州,甘肃,嘉峪关,金昌,酒泉地区,兰州,临夏回族自治州,陇南地区,平凉地区,庆阳地区,天水,武威,张掖地区;广东,潮州,从化,东莞,番禺,佛山,高明,广东,广州,河源,花都,惠州,江门,揭阳,茂名,梅州,南海,清远,三水,汕头,汕尾,韶关,深圳,顺德,阳江,云浮,增城,湛江,肇庆,中山,珠海;广西,百色地区,北海,崇左,防城港,广西,贵港,桂林,河池地区,贺州地区,来宾,柳州,南宁,钦州,梧州,玉林;贵州,安顺,毕节,毕节地区,贵阳,贵州,六盘水,黔东南苗族侗族自治州,黔南布依族苗族自治州,黔西南布依族苗族自治,铜仁,铜仁地区,遵义;海南,儋州,海口,海南,三亚;河北,保定,沧州,承德,邯郸,河北,衡水,廊坊,秦皇岛,石家庄,唐山,邢台,张家口;河南,安阳,河南,鹤壁,潢川,焦作,开封,洛阳,漯河,南阳,平顶山,濮阳,三门峡,商丘,新乡,信阳,许昌,郑州,周口,驻马店;黑龙江,大庆,大兴安岭,大兴安岭地区,哈尔滨,鹤岗,黑河,黑龙江,鸡西,佳木斯,牡丹江,七台河,齐齐哈尔,双鸭山,绥化,伊春;湖北,鄂州,恩施,湖北,黄冈,黄石,荆门,荆州,潜江,神农架林区,十堰,随州,天门,武汉,仙桃,咸宁,襄樊,孝感,宜昌;湖南,长沙,常德,郴州,衡阳,湖南,怀化,娄底,邵阳,湘潭,湘西土家族苗族自治州,益阳,永州,岳阳,张家界,株洲;吉林,白城,白山,长春,珲春,吉林,辽源,梅河口,四平,松原,通化,延边朝鲜族自治州,延吉;江苏,常州,淮安,江苏,连云港,南京,南通,苏州,宿迁,泰州,无锡,徐州,盐城,扬州,镇江;江西,抚州,赣州,吉安,江西,景德镇,九江,南昌,萍乡,上饶,新余,宜春,鹰潭;辽宁,鞍山,本溪,朝阳,大连,丹东,抚顺,阜新,葫芦岛,锦州,辽宁,辽阳,盘锦,沈阳,铁岭,营口;内蒙古,阿拉善盟,巴彦淖尔盟,巴彦卓尔盟,包头,赤峰,东胜,鄂尔多斯,海拉尔,呼和浩特,呼伦贝尔,集宁,临河,内蒙古,通辽,乌海,乌兰察布盟,锡林郭勒盟,锡林浩特,兴安盟;宁夏,固原,宁夏,石嘴山,吴忠,银川,中卫;青海,格尔木,果洛藏族自治州,海北藏族自治州,海东地区,海南藏族自治州,海西蒙古族藏族自治州,黄南藏族自治州,青海,西宁,玉树藏族自治州;山东,滨州,德州,东营,菏泽,济南,济宁,莱芜,聊城,临沂,青岛,日照,山东,泰安,威海,潍坊,烟台,枣庄,淄博;山西,长治,大同,晋城,晋中,临汾,吕梁,吕梁地区,山西,朔州,太原,忻州,阳泉,运城;陕西,安康,宝鸡,汉中,陕西,商洛,铜川,渭南,西安,咸阳,延安,榆林;上海,上海;四川,阿坝藏族羌族自治州,巴中,成都,达州,德阳,甘孜藏族自治州,广安,广元,乐山,凉山彝族自治州,泸州,眉山,绵阳,内江,南充,攀枝花,四川,遂宁,雅安,宜宾,资阳,自贡;台湾,台湾;天津,天津;未知,未知;西藏,阿里地区,昌都地区,拉萨,林芝地区,那曲地区,日喀则地区,山南地区,西藏;香港,香港;***,阿克苏,阿克苏地区,阿勒泰,阿勒泰地区,巴音郭楞蒙古自治州,博尔塔拉蒙古自治州,昌吉,昌吉回族自治州,哈密,哈密地区,和田地区,喀什,喀什地区,克拉玛依,克孜勒苏柯尔克孜自治,奎屯,石河子,塔城地区,吐鲁番地区,乌鲁木齐,***,伊犁哈萨克自治州;云南,保山,楚雄彝族自治州,大理白族自治州,德宏傣族景颇族自治州,迪庆藏族自治州,红河哈尼族彝族自治州,昆明,丽江地区,临沧地区,怒江傈傈族自治州,曲靖,思茅地区,文山壮族苗族自治州,西双版纳傣族自治州,玉溪,云南,昭通;浙江,杭州,湖州,嘉兴,金华,丽水,宁波,衢州,绍兴,台州,温州,浙江,舟山;中央,中央;重庆,重庆"
fillcity = (p) ->
  i = undefined
  j = undefined
  objcity = document.getElementById("city")
  i = objcity.options.length - 1
  while i >= 1
    objcity.removeChild objcity.options[i]
    i--
  str = strCity
  t1 = str.split(";")
  t2 = undefined
  i = 0
  while i < t1.length
    t2 = t1[i].split(",")
    if t2[0] is p
      j = 1
      while j < t2.length
        oItem = document.createElement("OPTION")
        oItem.text = t2[j]
        oItem.value = t2[j]
        objcity.options.add oItem
        oItem.selected = true  if oItem.text is ""
        j++
    i++
  return


# 页面加载完成后
window.onload = ->
  i = undefined
  j = undefined
  str = strCity
  t1 = str.split(";")
  t2 = undefined
  objprovince = document.getElementById("province")
  i = 0
  while i < t1.length
    t2 = t1[i].split(",")
    oItem = document.createElement("OPTION")
    oItem.text = t2[0]
    oItem.value = t2[0]
    objprovince.options.add oItem
    if t2[0] is ""
      oItem.selected = true
      fillcity t2[0]
    i++
  objprovince.onchange = ->
    fillcity @value
    return

  return